#+TITLE: Project Scratch

* TODOs
- [ ] Concatenate the _about_ section into _home_
- [ ] Nav.js and partials/nav.html to also add page footer

* Macro calculations

#+CONSTANTS: num_serves=4

| !                      |     cal | protein |   carb |   fat | fiber |
|------------------------+---------+---------+--------+-------+-------|
| #+TBLFM: $num_serves=4 |         |         |        |       |       |
| Pasta                  |    1484 |      52 |    278 |     6 |    21 |
| Chicken breast         |     360 |      67 |      0 |     8 |     0 |
| Spinach                |       7 |       1 |    0.4 |   0.1 |     1 |
| Cucumber               |      23 |       1 |      5 |   0.2 |     1 |
| Cherry tomatoes        |      45 |       2 |      7 |   0.5 |     3 |
| Sundried tomatoes      |     575 |      14 |     29 |    43 |    14 |
| Onion                  |      13 |     0.4 |      3 |     0 |     1 |
| Parsley                |      11 |       1 |      1 |   0.2 |     1 |
| Feta                   |     198 |      11 |      3 |    11 |     0 |
| Greek yoghurt          |      74 |      13 |      4 |   0.5 |     0 |
| Apple cider vinegar    |       6 |       0 |    0.3 |     0 |     0 |
| EVOO                   |     135 |       0 |      0 |    15 |     0 |
| SUMS                   | 2931.00 |  162.40 | 330.70 | 84.50 | 42.00 |
| PER-SERVE              |  732.75 |   40.60 |  82.67 | 21.12 | 10.50 |
#+TBLFM: @15$2..@15$6=vsum(@3..@14);%.2f :: @16$2..@16$6=@15/$num_serves;%.2f

